Repository: wreedb/confidant
Catalog: i18n/po/*.po
Languages: es_mx, pt_br

source: source file {} does not exist!
es_mx: ¡el archivo fuente {} no existe!
pt_br: o arquivo source {} não existe!

source: skipping {}, already linked
es_mx: omitiendo {}, ya está vinculado
pt_br: ignorando {}, já está vinculado

source: destination {} already exists, skipping
es_mx: el destino {} ya existe, omitiendo
pt_br: o arquivo de destino {} já existe, ignorando

source: failed to remove broken symlink at {}
es_mx: no se ha podido eliminar el enlace simbólico roto en {}
pt_br: falha ao remover o link simbólico quebrado no caminho {}

source: removing broken symlink at {}
es_mx: eliminar enlace simbólico roto en {}
pt_br: removendo link simbólico quebrado no caminho {}

source: parent directory for {} doesn't exist, skipping
es_mx: el directorio principal {} no existe, omitiendo
pt_br: o diretório pai para {} não existe, ignorando

source: failed to create directory {}
es_mx: no se pudo crear el directorio {}
pt_br: falha ao criar diretório no caminho {}

source: created directory {}
es_mx: directorio creado {}
pt_br: diretório criado no caminho {}

source: no write permissions for directory {}
es_mx: sin permisos de escritura para directorio {}
pt_br: sem permissões de gravação para o diretório no caminho {}

source: failed to create symlink at {}
es_mx: no se pudo crear el enlace simbólico en {}
pt_br: falha ao criar link simbólico no caminho {}

source: linked {}
es_mx: vinculado {}
pt_br: vínculo {}

source: template {} required no links
es_mx: template {} no necesitaba enlaces
pt_br: template {} não requer links simbólicos

source: processed 1 item
es_mx: procesó un item
pt_br: processou um item

source: processed {} items
es_mx: procesó {} items
pt_br: processou {} items

source: processed 1 template
es_mx: procesó un template
pt_br: processou um template

source: processed {} templates
es_mx: procesó {} templates
pt_br: processou {} templates

source: destination {} already exists and is not identical to source, skipping
es_mx: el destino {} ya existe y no es idéntico a source, omitiendo
pt_br: o caminho de destino {} já existe e não é igual ao de source, ignorando

source: parent directory for {} does not exist, skipping
es_mx: el directorio principal de {} no existe, omitiendo
pt_br: o diretório pai para {} não existe, ignorando

source: link {} source {} is not a directory
es_mx: link {} source {} no es un directorio
pt_br: link {} source {} não é um diretório

source: failed to create symlink for {} at {}
es_mx: no se pudo crear el enlace simbólico para {} en {}
pt_br: falha ao criar o link simbólico para {} no caminho {}

source: no links were needed
es_mx: no se necesitaban enlaces
pt_br: nenhum link foi necessário

source: created 1 normal link
es_mx: creó un enlace normal
pt_br: criou um link normal

source: created {} normal links
es_mx: creó {} enlaces normales
pt_br: criou {} link normal

source: your configuration
es_mx: tu amigo de configuración
pt_br: seu companheiro de configuração

source: pal and confidant
es_mx: y confidente
pt_br: e confidente

source: actions
es_mx: acciones
pt_br: ações

source: initialize a repository
es_mx: inicializar un repositorio
pt_br: inicializar um repositório

source: view configuration
es_mx: ver configuración
pt_br: visualizar configuração

source: create symlinks
es_mx: crear enlaces simbólicos
pt_br: criar links simbólicos

source: display help for subcommands
es_mx: ayuda para subcomandos
pt_br: mostrar ajuda para subcomandos

source: brief command-line usage info
es_mx: información breve sobre el uso
pt_br: informações breves sobre o uso

source: display version info
es_mx: mostrar información de la versión
pt_br: mostrar informações da versão

source: options
es_mx: opciones
pt_br: opções

source: output more information about actions taken
es_mx: dar mas informacion durante la ejecucion
pt_br: mostrar mais informações durante as ações

source: suppress non-error messages
es_mx: ocultar mensajes que no son de error
pt_br: ocultar mensagens que não são erros

source: display this help
es_mx: mostrar este mensaje de ayuda
pt_br: mostrar esta ajuda

source: usage
es_mx: uso
pt_br: uso

source: action
es_mx: acción
pt_br: ação

source: see
es_mx: consulte
pt_br: consulte

source: or
es_mx: o
pt_br: ou

source: for more information about a specific action and its' respective options.
es_mx: para obtener mas informacion sobre un comando específico y sus opciones
pt_br: para mais informações sobre uma ação específica e suas opções

source: initialize a confidant repository
es_mx: inicializar un repositorio
pt_br: inicializar um repositório

source: arguments
es_mx: argumentos
pt_br: argumentos

source: PATH
es_mx: RUTA
pt_br: CAMINHO

source: specify the path to initialize
es_mx: especifique la ruta del directorio para inicializar
pt_br: especifique o caminho do diretório para inicializar

source: default: current working directory
es_mx: predeterminado: directorio actual
pt_br: padrão: diretório de trabalho atual

source: show what actions
es_mx: solo
pt_br: mostrar as ações que

source: would
es_mx: simular
pt_br: seriam

source: be taken
es_mx: las acciones
pt_br: executadas

source: output more information about actions
es_mx: mostrar más información sobre las acciones
pt_br: mostrar mais informações durante as ações

source: view configuration settings
es_mx: ver configuración
pt_br: veja sua configuração

source: display current configuration settings
es_mx: mostrar la configuración actual
pt_br: veja sua configuração atual

source: find the value of a setting by name
es_mx: buscar el valor de una configuración por nombre
pt_br: obter o valor de uma configuração pelo nome

source: see 'confidant help config
es_mx: consulte 'confidant help config
pt_br: consulte 'confidant help config

source: for more information about a specific command and its' respective options.
es_mx: para obtener mas informacion sobre un comando específico y sus opciones
pt_br: para mais informações sobre uma ação específica e suas opções

source: display current configuration
es_mx: mostrar la configuración actual
pt_br: veja sua configuração atual

source: specify a configuration file to operate on
es_mx: especifique el archivo de configuración con el que desea trabajar
pt_br: especifique um arquivo de configuração a ser usado

source: default: <current directory>/confidant.ucl
es_mx: predeterminado: <directorio actual>/confidant.ucl
pt_br: padrão: <diretório de trabalho atual>/confidant.ucl

source: display the global configuration
es_mx: mostrar la configuración global
pt_br: veja sua configuração global

source: output configuration in JSON format
es_mx: configuración de salida en formato JSON
pt_br: exiba sua configuração no formato JSON

source: find a configuration value by name
es_mx: buscar el valor de una configuración por nombre
pt_br: encontra o valor de uma configuração pelo nome

source: QUERY
es_mx: CONSULTA
pt_br: CONSULTA

source: the configuration setting to search for
es_mx: la configuración para buscar
pt_br: a configuração a ser pesquisada

source: you may search for nested values by using
es_mx: puede buscar valores anidados utilizando
pt_br: você pode buscar por valores aninhados utilizando

source: periods to traverse, e.g.: 'repository.url'
es_mx: puntos para recorrerlos, por ejemplo: 'repository.url'
pt_br: pontos para percorrê-los, por exemplo: 'repository.url'

source: query the global configuration
es_mx: consulta la configuración global
pt_br: consulte sua configuração global

source: apply symlinks from your configuration file
es_mx: aplique los enlaces simbólicos desde su configuración
pt_br: aplique links simbólicos da sua configuração

source: specify a set of tagged links to apply, separated by commas
es_mx: especifique un grupo de enlaces "tagged" que se aplicarán, separados por comas
pt_br: especifique um conjunto de links "tagged" a serem aplicados, separados por vírgulas

source: specify the configuration file to operate on
es_mx: especifique el archivo de configuración con el que desea trabajar
pt_br: especifique um arquivo de configuração a ser usado

source: no permission to write files to {}
es_mx: sin permiso para escribir archivos en {}
pt_br: sem permissões de gravação para o diretório no caminho {}

source: file {} already exists, not overwriting
es_mx: el archivo {} ya existe, no se sobrescribirá
pt_br: o arquivo {} já existe, não será substituído

source: failed to open {} for writing
es_mx: no se puede abrir {} para escribir
pt_br: falha ao abrir o arquivo no caminho {} para gravação

source: wrote configuration to file {}
es_mx: escribió el archivo de configuración en {}
pt_br: gravou a configuração no arquivo no caminho {}

source: file {} already exists, not overwriting.
es_mx: el archivo {} ya existe, no se sobrescribirá
pt_br: o arquivo {} já existe, não será substituído

source: unable to open {} for writing
es_mx: no se puede abrir {} para escribir
pt_br: falha ao abrir o arquivo no caminho {} para gravação

source: failed to create parent directory {} for global config file!
es_mx: ¡no se pudo crear el directorio principal {} para el archivo de configuración global!
pt_br: falha ao criar o diretório pai para o arquivo de configuração global no caminho {}!

source: failed to create global config file at {}!
es_mx: ¡no se pudo crear el archivo de configuración global en {}!
pt_br: falha ao criar o arquivo de configuração global no caminho {}!

source: --quiet and --verbose are mutually exclusive.
es_mx: --quiet y --verbose se excluyen mutuamente.
pt_br: --quiet e --verbose são mutuamente exclusivos.

source: unable to parse command line
es_mx: no se puede analizar la línea de comandos
pt_br: falha ao analisar a linha de comando

source: version {}
es_mx: versión {}
pt_br: versão {}

source: setting {} not found in configuration
es_mx: no se encuentra {} en la configuración
pt_br: chave {} não encontrada na configuração

source: wrote sample config file to {}
es_mx: escribí un archivo de configuración de muestra en {}
pt_br: gravou o arquivo de configuração de exemplo no caminho {}

source: info
es_mx: información

source: warn
es_mx: aviso
pt_br: aviso

source: debug
es_mx: depuración

source: trace
es_mx: traza
pt_br: rastreio

source: file at
es_mx: archivo en
pt_br: o arquivo no caminho

source: does not exist
es_mx: ¡el archivo fuente {} no existe!
pt_br: não existe

source: failed to open file at
es_mx: no se puede abrir {} para escribir
pt_br: falha ao abrir o arquivo no caminho

source: failed while parsing
es_mx: error al analizar
pt_br: falha durante a análise de

source: failed to parse {} value as a string!
es_mx: ¡no se pudo analizar {} como una cadena!
pt_br: falha ao analisar o parâmetro {} como uma string

source: field {} not specified
es_mx: no se especificó la entrada {}
pt_br: parâmetro {} não especificado

source: failed to parse {} as a node!
es_mx: ¡no se pudo analizar {} entrada {} como nodo!
pt_br: falha ao analisar o parâmetro {} como um objeto!

source: failed to parse {} field {} as a string!
es_mx: ¡no se pudo analizar {} entrada {} como una cadena!
pt_br: falha ao analisar o valor de chave {} {} como uma string!

source: {} field {} must be a string!
es_mx: ¡el campo {} {} debe ser una candena!
pt_br: o parâmetro {} {} deve ter um valor do tipo string!

source: link {} is missing a {} value!
es_mx: ¡link {} le falte el valor {}!
pt_br: o link {} exige o valor da chave {}!

source: type {} is not recognized, expected one of {} or {}, using default
es_mx: type {} no se reconoce, se espera uno de los siguientes: {} o {}, utilizando el valor predeterminado
pt_br: o tipo {} não é reconhecido, esperava um dos tipos {} ou {}, usando o padrão

source: template {} is missing a {} value!
es_mx: ¡template {} le falte el valor {}!
pt_br: o template {} exige o valor da chave {}!

source: failed to get {} items field as a list!
es_mx: ¡no se pudo analizar {} items entrada como una lista!
pt_br: falha ao analisar o valor de chave {} items como uma lista!

source: template {} {} field is not a list!
es_mx: ¡template {} {} entrada no es una lista!
pt_br: o valor do parâmetro {} do template {} não é uma lista!

source: template {} has no {} list!
es_mx: ¡template {} no tiene lista {}!
pt_br: o template {} exige o valor de chave {}!

source: log-level {} is invalid!
es_mx: ¡log-level {} no es válido!
pt_br: o valor log-level {} é inválido!

source: error
pt_br: erro
